//-------------------------------------------------
//Include Header
#include "CSU32P10.h"
#include "define_data.h"
#include "define_function.h"

//具体寄存器含义请参考芯片用户手册，以用户手册为准
/*----------------------------------------------------------------------------
函数名称：F_Initial_MCU
具体描述：初始化Mcu的配置
----------------------------------------------------------------------------*/
void MCU_Initialization(void)
{
	//-----------------------------------------------------------------	
	//清状态寄存器
	//-----------------------------------------------------------------
	
	////////////////【嵌入单条汇编语句示例】/////////////////////////////
	asm("clrf _STATUS");			//清状态寄存器
	
	//-----------------------------------------------------------------	
	//设置MCK寄存器
	//-----------------------------------------------------------------
	MCK 	= 0x00;					//打开内部WDT晶振                    
									//mck：（上电复位值为：uu1uuuuu）    							                                 
									//Bit5(CST_WDT)：内部WDT晶振启动开关 
									//				1：内部WDT晶振关闭     
									//				0：内部WDT晶振打开     
									

	//-----------------------------------------------------------------
	//设置WDTCON寄存器
	//说明：如果要开启WDT，首先要开启WDT晶振开关(CST_WDT)；至于RAM是否要清0，视情况而定。	   
	//-----------------------------------------------------------------
	WDTCON 	= 0x81;					//使能看门狗、1.024s溢出复位	           
									//wdtcon：10000001b（上电复位值为：0uuuu000）	   
									//                                      
									//Bit7		wdten：看门狗使能位;       
									//                                      
									//Bit[2-0]	wdts：当wdtin为11111111b时 
									//			000   溢出时间为 2048ms    
									//			001   溢出时间为 1024ms    
									//			010   溢出时间为 512ms     
									//			011   溢出时间为 256ms     
									//			100   溢出时间为 128ms     
									//			101   溢出时间为 64ms      
									//			110   溢出时间为 32ms      
									//			111   溢出时间为 16ms      																																																		
	
	WDTIN 	= 0xff;					//WDTIN:(上电默认值为:11111111)
									//设置WDT溢出时间值	
									//当WDTIN不是FFH时，按相应的比例进行换算溢出的时间值
		
	//-----------------------------------------------------------------
	//清除RAM(注意：新版C编译器不需要自己清SRAM，编译器已经清了，所以不能执行这一步)	
	//-----------------------------------------------------------------	

	//-----------------------------------------------------------------
	//初始化IO口
	//-----------------------------------------------------------------	
	//-------------------------------
	//PT1端口[7:1]
	//-------------------------------
	PT1 = 0x00;						//PT1:(上电默认值:uxxxxxxx)
	
	PT1EN = 0x30;					//PT1EN: 00110000b (上电默认值:u000u000)	
					 				//	0 = 定义为输入口(PT1.3 only input)
									//	1 = 定义为输出口
	PT1PU = 0x00;					//PT1PU:(上电默认值:u0000000)
									//	0 = 断开上拉电阻
									//	1 = 使用上拉电阻
	PT1CON = 0x01;					//设置外部中断1和外部中断0
									//PT1CON: 00000001b (上电默认值:00000000)
									//Bit7   PT11OD: PT1.1漏极开路使能位(以便于IO口输出不同的电压值)
									//	0 = 禁止PT1.1漏极开路
									//	1 = 使能PT1.1漏极开路
								
									//Bit6   PT1W[3]: PT1.5外部中断1使能
									// 	0 = 禁止PT1.5外部中断1 
									//	1 = 使能PT1.5外部中断1
								
									//Bit5   PT1W[2]: PT1.4外部中断1使能
									//	0 = 禁止PT1.4外部中断1 
									//	1 = 使能PT1.4外部中断1
								
									//Bit4   PT1W[1]: PT1.3外部中断1使能
									//	0 = 禁止PT1.3外部中断1 
									//	1 = 使能PT1.3外部中断1
								
									//Bit3   PT1W[0]: PT1.1外部中断1使能
									//	0 = 禁止PT1.1外部中断1 
									//	1 = 使能PT1.1外部中断1
								
									//Bit2   E1M: 外部中断1触发模式
									//	1 = 外部中断1为下降沿触发
									//	0 = 外部中断1在状态改变时触发
								
									//Bit1-0 E0M[1:0]: 外部中断0触发模式
									//	00 = 外部中断0为下降沿触发
									//	01 = 外部中断0为上升沿触发
									//	10 = 外部中断0在状态改变时触发
									//	11 = 外部中断0在状态改变时触发		

	//-------------------------------
	//PT3端口[4:0]，设置P3.1为AD模拟输入口
	//-------------------------------
	PT3	= 0x00;						//GPIO 3口数据标志位	pt3[4:0]：（上电复位值：uuuxxxxx）
	
	PT3EN = 0x04;					//设置GPIO 3口输入/输出控制标志         
									//pt3en[4:0]：00000100b（上电复位值为：uuu00000）
									//Bit 4		pt3.4的I/O控制标志位；     
	                                //			0 = 定义为输入口           
	                                //			1 = 定义为输出口           
	                                //       	                           
	                                //Bit 3		pt3.3的I/O控制标志位；     
	                                //			0 = 定义为输入口           
	                                //			1 = 定义为输出口           
	                                //       	                           
	                                //Bit 2		pt3.2的I/O控制标志位；     
	                                //			0 = 定义为输入口           
	                                //			1 = 定义为输出口           
	                                //       	                           
	                                //Bit 1		pt3.1的I/O控制标志位；     
	                                //			0 = 定义为输入口           
	                                //			1 = 定义为输出口           
	                                //       	                           
	                                //Bit 0		pt3.0的I/O控制标志位；     
	                                //			0 = 定义为输入口           
	                                //			1 = 定义为输出口           
	                                                             	                                                        
	PT3PU = 0x00;					//设置GPIO 3口上拉电阻使能标志	                                    
									//PT3PU[4:0]：（上电复位值为：uuu00000）                             
									//Bit 4		pt3.4 控制标志位；0 = 断开上拉电阻，1 = 使用上拉电阻   
									//Bit 3		pt3.3 控制标志位；0 = 断开上拉电阻，1 = 使用上拉电阻   
									//Bit 2		pt3.2 控制标志位；0 = 断开上拉电阻，1 = 使用上拉电阻   
									//Bit 1		pt3.1 控制标志位；0 = 断开上拉电阻，1 = 使用上拉电阻   
									//Bit 0		pt3.0 控制标志位；0 = 断开上拉电阻，1 = 使用上拉电阻   
	
	PT3CON	= 0x00;					//设置GPIO 3口模拟/数字端口使能标志                                  
									//pt3con[4:0]：（上电复位值为：uuu00000）                            
									//Bit 4		pt3.4的I/O控制标志位；0 = 定义为数字口，1 = 定义为模拟口
									//Bit 3		pt3.3的I/O控制标志位；0 = 定义为数字口，1 = 定义为模拟口
									//Bit 2		pt3.2的I/O控制标志位；0 = 定义为数字口，1 = 定义为模拟口
									//Bit 1		pt3.1的I/O控制标志位；0 = 定义为数字口，1 = 定义为模拟口
									//Bit 0		pt3.0的I/O控制标志位；0 = 定义为数字口，1 = 定义为模拟口

	//-------------------------------
	//PT5端口[1:0]
	//-------------------------------	
	PT5 =	0x00;					//GPIO5口数据标志位	PT5[1:0]：（上电复位值为：uuuuuuxx）     
	
	PT5EN = 0x03;					//PT5EN[1:0]：00000001b（上电复位值为：uuuuuuxx）                               
	                                //Bit 1		pt5.1的I/O控制标志位；0 = 定义为输入口，1 = 定义为输出口 
	                                //Bit 0		pt5.0的I/O控制标志位；0 = 定义为输入口，1 = 定义为输出口 
	                                  	                                  
	PT5PU = 0x00;					//设置GPIO 5口上拉电阻使能标志	                                
	                                //PT5PU[1:0]：（上电复位值为：uuuuuuxx）                          
	                                //Bit 1		pt5.1 控制标志位；0 = 断开上拉电阻，1 = 使用上拉电阻
	                                //Bit 0		pt5.0 控制标志位；0 = 断开上拉电阻，1 = 使用上拉电阻
	
	PT5CON	=	0x00;				//设置pt5.0、pt5.1禁止开漏输出		                              
									//pt5con[1:0]：（上电复位值为：uuuuuuxx）                           
									//Bit 1		pt5.1 控制标志位；0 = 禁止开漏输出，1 = 使能开漏输出  
									//Bit 0		pt5.0 控制标志位；0 = 禁止开漏输出，1 = 使能开漏输出  

	//-----------------------------------------------------------------
	//AD初始化，参考电压VDD，通道0，程序中用到AD
	//-----------------------------------------------------------------*/	
	SRADCON0 = 0x01;				//设置ADC输入信号的获取时间                       
									//B1:B0 = 01		ADC CLOCK = CPUCLK/2=4M/2=2M       
									//B5:B4 = 00     转换所需时间约14us               
									//sradcon0：（上电复位值为：uu00uu00）            
									//Bit[5:4]	sradacks[1:0] 	ADC输入信号获取时间 
									//			00				16个ADC时钟         
									//			01				 8个ADC时钟          
									//			10				 4个ADC时钟          
									//			11				 2个ADC时钟         
									//                                                
									//Bit[1:0]	sradcks[1:0] 	ADC采样时钟         
									//			00				CPUCLK              
									//			01				CPUCLK/2            
									//			10				CPUCLK/4            
									//			11				CPUCLK/8            
									                        	                                                                                           
	SRADCON1 =	0x00;				//设置ADC的转换配置	B[1:0]10 内部1.4V作参考                                                     
									//sradcon1：10000000b（上电复位值为：00000000）                                                              
									//Bit 7		sraden 		ADC使能位                                                               
									//			1：使能, 0：禁止                                                                    
									//                                                                                                  
									//Bit 6 		srads 		ADC启动位/状态控制位                                                        
									//			1：开始，转换过程中                                                                 
									//			0：停止，转换结束                                                                   
									//			当置位后，启动ADC转换，转换完成会自动清0                                            
									//                                                                                                  
									//Bit 5 		often 		转换结果选择控制位                                                          
									//			1：转换结果放在sroft寄存器中                                                        
									//			0：转换结果放在srad寄存器中                                                         
									//                                                                                                  
									//Bit 4 		calif 		校正控制位(often为0时有效)                                                  
									//			1：使能校正，即AD转换的结果是减去了sroft失调电压值                                  
									//			0：禁止校正，即AD转换结果是没有减去sroft失调电压值                                  
                                    //                                                                                                  
									//Bit 3 		enov 		使能比较器溢出模式(calif为1时有效)                                          
									//			1：使能，上溢或下溢直接是减去后的结果                                               
									//			0：禁止，下溢为000h，上溢为fffh                                                     
									//                                                                                                  
									//Bit 2 		offex 		offset交换                                                                  
									//			1：比较器两端信号交换                                                               
									//			0：比较器两端信号不交换（正端为信号，负端为参考电压）                               
									//                                                                                                  
									//Bit[1:0]	vrefs[1:0] 	ADC参考电源选择                                                           
									//			(注：不同参考电压切换，建议延迟10uS再做AD转换)                                      
									//			vrefs[1:0]		AD参考电压                                                          
									//			00				VDD                                                                 
									//			01				PT3.0外部参考电源输入                                               
		                            //			10				内部参考电压（参考电压的设置在METCH寄存器中）                         
                                    //			11				内部参考电压，PT3.0可外接电容作为内置参考电压滤波使用，以提高精度。 
                                                                                                                  
	SRADCON2 = 0x00;				//设置ADC输入通道                                     
									//sradcon2：00010000b（上电复位值为：0000uuuu）                
									//Bit[7:4]	chs[3:0] 	ADC输入通道选择位           
									//  			0000			AIN0输入                
									//  			0001			AIN1输入                
									//  			0010			AIN2输入                
									//  			0011			AIN3输入                
									//  			0100			AIN4输入                
									//  			0101  			AIN5输入，内部1/8VDD    
									//  			0110			AIN6输入，内部参考电压  
									//  			0111			AIN7输入，内部接地      
									//  			其它			保留                    
									//	1010 = 内部接地
									//	1011 = 运算放大器的输出C0作为AD的输入(内部需要做滤波处理)							
									//   其他 = 内短 									
									
//	METCH = 0x00;					//选择内部参考电压                          
	                                //metch：（上电复位值为：00000000）         
	                                //Bit[6:4]	REF_SEL [2:0]	内部参考电压  
	                                //				0XX          1.4V         
	                                //				100          1.4V         
	                                //				101          2.0V         
	                                //				110          3.0V         
	                                //				111          4.0V         	    	    
    	   																	
	SRADL=0;
	SRADH=0;								
	//-----------------------------------------------------------------
	//定时器0初始化，程序中用到定时器0
	//-----------------------------------------------------------------*/
	TM0CON	= 0xf0;					//设置定时器0，此处t0rate=cpu/128=4M/128=31.25K	周期=32us                     
									//tm0con：（上电复位值为：0000u100）                                            
									//Bit 7  	t0en  定时器0使能位                                                   	
									//			1：使能定时器0                                                    
									//	  		0：禁止定时器0                                                    
									//                                                                              
									//Bit[6:4] 	t0rate[2:0]		定时器0时钟选择                                   
									//			t0rate [2:0]     tm0clk                                           
									//			000		         ckt0                                             
									//	 		001				 ckt0 /2                                          
									//			010				 ckt0 /4                                          
									//			011				 ckt0 /8                                          
									//			100				 ckt0 /16                                         
									//			101				 ckt0 /32                                         
									//			110				 ckt0 /64                                         
									//			111				 ckt0 /128                                        
									//                                                                              
									//Bit 2 		t0rstb	定时器0复位                                               
									//			1：禁止定时器0复位                                                
									//			0：使能定时器0复位，当将该位为0时，定时器0复位后，T0RSTB会自动置1 
									//                                                                              
									//Bit[1:0]	t0sel[1:0]	时钟源选择                                            
									//			t0sel[1:0]	定时器0时钟源                                         
									//			00          cpuclk                                                
		                            //			01			mck                                                   
		                            //			1x			内部32K wdt时钟，仅当内部wdt晶振打开时有效            
									
	TM0IN	=	124;				//tm0溢出时间为 32us*(124+1)=4ms	     
	                                //定时器0溢出时间计算方法：            
	                                //	定时器0溢出时间=(tm0in+1)/tm0clk 
	
	TM0CNT 	= 	0;				//清定时器0计数寄存器，只读

	//-----------------------------------------------------------------
	//定时器2初始化，程序中用到定时器2，用于串口发送
	//-----------------------------------------------------------------*/
  	TM2CON  = 0x00;		   			//设置定时器2，此处tm2clk=16MHz，作为PWM口                                          
									//tm2con：（上电复位值为：00000100）                                                
									//Bit 7 		t2en 	定时/计数器2使能位                                            
									//       	1：使能定时器2                                                            
									//       	0：禁止定时器2                                                             
									//                                                                                  
									//Bit[6:4] 	t2rate[2:0] 	定时/计数器2时钟选择                                  
									//			t2rate [3:0]	tm2clk	(t2rate[3]在metch寄存器中)                    
									//			0-000			cpuclk                                                
									//			0-001			cpuclk /2                                             
									//			0-010			cpuclk /4                                             
									//			0-011			cpuclk /8                                             
									//			0-100			cpuclk /16                                            
									//			0-101			cpuclk /32                                            
									//			0-110			cpuclk /64                                            
									//			0-111			cpuclk /128                                           
									//			1-000			mck                                                   
									//			1-001			mck /2                                                
									//			1-010			mck /4                                                
									//			1-011			mck /8                                                
									//			1-100			mck /16                                               
									//			1-101			mck /32                                               
									//			1-110			mck /64                                               
									//			1-111			mck /128                                              
									//                                                                                  
									//Bit 3 		t2cks	定时/计数器2时钟源选择位                                      
									//			1：pt1.0作为时钟                                                      
									//			0：cpuclk或mck的分频时钟                                              
									//                                                                                  
									//Bit 2 		t2rstb 	定时/计数器2复位                                              
									//			1：禁止定时/计数器2复位                                               
									//			0：使能定时/计数器2复位，当将该位为0时，定时器2复位后，T2RSTB会自动置1
									//                                                                                  
									//Bit 1:0  	t2out pwm2out 	pt5.0口输出控制，仅当pt5.0配置为输出时有效            
									//			0	 	0	 	IO输出                                                
									//		 	0		1		PWM2输出                                               
									//			1		0		蜂鸣器输出                                            
									//			1		1		PWM2输出                                              
  	                                                                                               
	TM2IN =0x00;					//清定时/计数器2溢出值                                       	
	TM2INH=0x00;                    //定时器2溢出时间计算方法：                                  
	                                //   	定时器2溢出时间=（tm2in[11:0]+1）/tm2clk （tm2in不为0）
	
	TM2R   = 0;						//清定时/计数器2的PWM高电平占空比控制寄存器 
	TM2RH  = 0;	
	        
	TM2CNT  = 0;					//清定时/计数器2计数寄存器
	TM2CNTH	= 0;
	
//	METCH = 0x00;					//定时器2时钟选择                                                 
	                                //metch：（上电复位值为：00000000）                               
	                                //Bit 1		t2rate[3]	定时器2的时钟选择：	0:cpuclk,	1:mck	
	
//	METCH1 = 0x00;					//设置PWM2的输出脚                                                              
	                                //metch1：（上电复位值为：00000000）                                            
	                                //Bit 2		pwm2po		pwm2输出脚选择                                        
	                                //			0：PT5.0做为PWM2输出口                                            
	                                //			1：PT3.1做为PWM2输出口                                            
	                                //			PWM2PO配置为1时，若T2OUT和PWM2OUT配置为2’b11，                   
	                                //				则PT5.0口还会有定时器2的蜂鸣器输出，而配置为2’b01时，则不会有
	                            
	//-----------------------------------------------------------------
	//定时器3初始化
	//-----------------------------------------------------------------*/	                            	                                                                                                                                                    
	TM3CON = 0x00;  				//设置定时器3,设置为IO输出                                                                                                                 
	                            	//tm3con：（上电复位值为：00000100）                                                                           	                            
						        	//Bit 7 		t3en 	定时/计数器3使能位                                                                                                    
						        	//       	1：使能定时器3                                                                                                                
						        	//       	0：禁止定时器3                                                                                                                    
						        	//                                                                                                             
						        	//Bit[6:4] 	t3rate[2:0] 	定时/计数器2时钟选择                                                              
						        	//			t3rate [3:0]	tm2clk	(t3rate[3]在metch寄存器中)                                                
						        	//			0-000			cpuclk                                                                            
						        	//			0-001			cpuclk /2                                                                         
						        	//			0-010			cpuclk /4                                                                         
						        	//			0-011			cpuclk /8                                                                         
						        	//			0-100			cpuclk /16                                                                        
						        	//			0-101			cpuclk /32                                                                        
						        	//			0-110			cpuclk /64                                                                        
						        	//			0-111			cpuclk /128                                                                       
						        	//			1-000			mck                                                                               
						        	//			1-001			mck /2                                                                            
						        	//			1-010			mck /4                                                                            
						        	//			1-011			mck /8                                                                            
						        	//			1-100			mck /16                                                                           
						        	//			1-101			mck /32                                                                           
						        	//			1-110			mck /64                                                                           
						        	//			1-111			mck /128                                                                          
						        	//                                                                                                             
						        	//Bit 3 		t3cks	定时/计数器3时钟源选择位                                                                  
						        	//			1：pt1.1作为时钟                                                                                  
						        	//			0：cpuclk或mck的分频时钟                                                                          
						        	//                                                                                                             
						        	//Bit 2 		t3rstb 	定时/计数器3复位                                                                          
						        	//			1：禁止定时/计数器3复位                                                                           
						        	//			0：使能定时/计数器3复位，当将该位为0时，定时器3复位后，t2rstb会自动置1                            
						        	//                                                                                                             
						        	//Bit 1:0  	t3out pwm3out 	pt5.1口输出控制，仅当pt5.1配置为输出时有效                                        
						        	//			0	 	0	 	IO输出                                                                            
						        	//		 	0		1		PWM3输出                                                                          
						        	//			1		0		蜂鸣器输出                                                                        
						        	//			1		1		PWM3输出                                                                          
							    	                                                                                                             
	TM3IN  = 0;					                                                                                                             
	TM3INH = 0;						//清定时/计数器3溢出值                                                                                         
									//定时器3溢出时间计算方法：                                                                                    
	                            	// 	定时器3溢出时间=（tm3in[11:0]+1）/tm3clk （tm3in不为0）                                                   
	                            	                                                                                                             
	TM3R = 0;   					                                                                                                             
	TM3RH = 0;						//清定时/计数器3的PWM高电平占空比控制寄存器                                                                    
	                            	                                                                                                            
	TM3CNT = 0;              	                                                                                                          
	TM3CNTH	= 0;					//清定时/计数器3计数寄存器                                                                                     
										                                                                                                  
		 		                	                                                                                            
	//METCH = 0x00;		 			//定时器3时钟选择                                                                                              
									//metch：（上电复位值为：00000000）                                                                            
									//Bit 2		t3rate[3]	定时器3的时钟选择：	0:cpuclk,	1:mck							                      
						 				                                                                                                      
	//METCH1 = 0x00;				//设置互补pwm3h和pwm3l                                                                                         
	  								//metch1：（上电复位值为：00000000）                                                                           
									//Bit 7		p3hinv		互补PWM3H取反控制位                                                                   
									//			        	0：PWM3H不取反                                                                        
									//			        	1：PWM3H取反输出                                                                      
									//	                                                                                                      
									//Bit 6		p3linv		互补PWM3L取反控制位                                                                   
									//	                    0：PWM3L不取反                                                                        
									//						1：PWM3L取反输出   					                                                  
									                                                                                                            
	TM3CON2 = 0x00;   				//设置死区时间                                                                                                 
									//tm3con2：（上电复位值为：00000000）                                                                          
									//Bit[7:6]	dt3ck[1:0]	定时器3死区时间时钟选择                                                               
									//			dt3ck[1:0]	dt3_clk                                                                               
									//			00       	mck                                                                                   
									//			01       	mck/2                                                                                 
									//			10       	mck/4                                                                                 
									//			11       	mck/8                                                                                 
									//                                                                                                             
									//Bit[5:3]	dt3cnt[2:0]	死区时间选择                                                                          
									//                        死区时间=dt3cnt[2:0]*dt3_clk                                                         
									//                                                                                                             
									//Bit 2		dt3_en		死区发生器3使能位                                                                     
									//           0：不使能死区发生器3                                                                              
									//           1：使能死区发生器3                                                                                
									//                                                                                                             
									//Bit 1 		p3h_oen		互补PWM3H输出使能                                                                     
									//           0：PWM3H不输出                                                                                    
									//           1：PWM3H从PT5.1输出                                                                               
									//                                                                                                             
									//Bit 0		p3l_oen		互补PWM3L输出使能                                                                     
									//           0：PWM3L不输出                                                                                    
									//           1：PWM3L从PT5.0输出 
	
	//-----------------------------------------------------------------
	//中断初始化
	//-----------------------------------------------------------------*/	
	INTE = 0x90;					//开启总中断使能、TM0中断使能、外部中断0使能              
	                                //inte：11010011b （上电复位值为：00u00u00）                        
	                                //Bit 7 		gie			全局中断使能标志                
	                                //			1 = 使能所有非屏蔽中断                      
	                                //			0 = 不使能所有中断                          
	                                //                                                        
	                                //Bit 6 		tm2ie		12-Bit定时/计数器2中断使能标志  
	                                //			1 = 使能定时/计数器2中断                    
	                                //			0 = 不使能定时/计数器2中断                  
	                                //                                                        
	                                //Bit 4 		tm0ie		8-Bit定时器0中断使能标志        
	                                //			1 = 使能定时器0中断                         
	                                //			0 = 不使能定时器0中断                       
	                                //                                                        
	                                //Bit 3 		sradie		AD中断使能标志                  
	                                //			1 = 使能AD中断                              
	                                //			0 = 不使能AD中断                            
	                                //                                                        
	                                //Bit 1 		e1ie		外部中断1使能标志               
	                                //			1 =使能外部中断1                            
	                                //			0 = 不使能外部中断1                         
	                                //                                                        
	                                //Bit 0 		e0ie		外部中断0使能标志               
	                                //			1 = 使能外部中断0                           
	                                //			0 = 不使能外部中断0    
	                                
	INTE2 = 0x00;  	    			//关闭定时器3中断使能
									//inte2：（上电复位值为：uuu0uuuu）
									//Bit 4 		tm3ie		12-Bit定时/计数器3中断使能标志
									//			1 = 使能定时/计数器3中断
									//			0 = 不使能定时/计数器3中断   
									
	INTF = 0x00;       	 			//清所有中断标志                                                         							
									//intf：（上电复位值为：u0u00u00）                                       							
									//Bit 6 		tm2if		12-Bit定时/计数器2中断标志，软件清零，硬件置高  							
									//			1 = 发生定时中断，必须软件清0                               							
									//			0 = 没发生定时中断                                          							
									//                                                                       							
									//Bit 4 		tm0if		8-Bit定时器0中断标志，软件清零，硬件置高        							
									//			1 = 发生定时中断，必须软件清0                               							
									//			0 = 没发生定时中断                                          							
									//                                                                       							
									//Bit 3 		sradif		AD中断中断标志，软件清零，硬件置高              							
									//			1 = 发生AD中断，必须软件清0                                 							
									//			0 = 没发生AD中断                                            							
									//                                                                       							
									//Bit 1 		e1if		外部中断1中断标志，软件清零，硬件置高           							
									//			1 =外部中断1发生中断，必须软件清0                           							
									//			0 =外部中断1没发生中断                                      							
									//                                                                       							
									//Bit 0 		e0if		外部中断0中断标志，软件清零，硬件置高           							
									//			1 = 外部中断0发生中断，必须软件清0                          							
									//			0 =外部中断0没发生中断                                      							
									//		                                                            							
	INTF2 = 0x00;					//清中断标志                                                             							
									//intf2：（上电复位值为：uuu0uuuu）                                      							
									//Bit 4 		tm3if		12-Bit定时/计数器3中断标志，软件清零，硬件置高  							
		                            //			1 = 发生定时中断，必须软件清0                               							
		      	                    //			0 = 没发生定时中断                                          							
								                               
}                                   
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    
                                    